In [1]:
# Importing pandas and numpy Libraries
import pandas as pd
import numpy as np

In [3]:
Data = pd.DataFrame({'Company':['Asus', 'HP', 'Apple', 'Dell', 'Lenovo'],
                    'Graphic_Card':['N', 'R', 'R', 'N', 'N'],
                    'Ci5': [1600,1700,np.nan,1900,2000],
                    'Ci7': [2100, 2200, 2300, 2400, np.nan]})
Data

  Company Graphic_Card     Ci5     Ci7
0    Asus            N  1600.0  2100.0
1      HP            R  1700.0  2200.0
2   Apple            R     NaN  2300.0
3    Dell            N  1900.0  2400.0
4  Lenovo            N  2000.0     NaN

In [5]:
V1 = lambda x:x.Ci5 > 1700
Data.groupby('Company').filter(V1)

  Company Graphic_Card     Ci5     Ci7
3    Dell            N  1900.0  2400.0
4  Lenovo            N  2000.0     NaN

In [10]:
V2 = lambda x:x.Ci5.isnull().sum() ==0
Data.groupby('Company').filter(V2) # Apple is remove from result.

  Company Graphic_Card     Ci5     Ci7
0    Asus            N  1600.0  2100.0
1      HP            R  1700.0  2200.0
3    Dell            N  1900.0  2400.0
4  Lenovo            N  2000.0     NaN

In [11]:
V3 = lambda x:x.Ci5.sum() ==0 # shows Apple in result
Data.groupby('Company').filter(V3)

  Company Graphic_Card  Ci5     Ci7
2   Apple            R  NaN  2300.0